#include <reg52.h>
#include "delay.h"
#include "hcsr04.h"

sbit TRIG = P1^6 ;
sbit ECHO = P1^5 ;

/*------------------------------------------------
                    初始化定时器0
------------------------------------------------*/
void initTimer0(void)
{

  TMOD|= 0x01;//定时器0工作方式1
  TH0=0x00;    
  TL0=0x00; 
  ET0=1;
  EA=1;
}
/*------------------------------------------------
                    测距函数
------------------------------------------------*/
float measureDistance()
{
	float s;       //距离变量
	initTimer0();    //初始化定时器0
	TRIG=1;       //触发信号是高电平脉冲，宽度大于10us
	us(10);
	TRIG=0;
	while(!ECHO); //等待高电平
	TR0=1;
	while(ECHO);  //等待低电平
	TR0=0;
	s=TH0*256+TL0;//取出定时器值高8位和低8位合并
	s=s/58;       //为什么除以58等于厘米，  Y米=（X秒*344）/2
			     // X秒=（ 2*Y米）/344 -> X秒=0.0058*Y米 -> 厘米=微秒/58 
	TH0=0;
	TL0=0;        //清除定时器0寄存器中的值
	return s;
}

/*------------------------------------------------
                 定时器0中断子程序
------------------------------------------------*/
void Timer0_isr(void) interrupt 1
{
 ECHO=0;
}
