/*-----------------------------------------------
  名称：遥控器红外解码
------------------------------------------------*/
#include<reg52.h>

sbit IR=P3^2;  //红外接口标志

/*------------------------------------------------
                全局变量声明
------------------------------------------------*/
bit isIrOk = 0;//红外码值处理完成标志
unsigned char  irTime;//2个下降沿之间的时间
unsigned char command=0x00;//数据码

/*------------------------------------------------
                  定时器0中断处理
------------------------------------------------*/

void T0_isr (void) interrupt 1 using 1
{
	irTime++;  //用于计数2个下降沿之间的时间
}

/*------------------------------------------------
                  外部中断0中断处理
------------------------------------------------*/
void EX0_isr (void) interrupt 0 //外部中断0服务函数
{
	static unsigned char i=0;						//红外信号脉冲序列索引
	static unsigned char irdata[32];			//用于存储每个电平的持续时间，8bits的address+8bits的~address+8bits的command+8bits的~command=32bits

	//检测红外信号，引导码 TC9012的头码，9ms+4.5ms=13.5ms,16M晶振为13.5/192*1000=70
	if(irTime<80&&irTime>40){
		i=0;//索引归零
	}else{
		irdata[i]=irTime;//存储每个电平的持续时间，用于以后判断是0还是1
		i++;
		//判断红外信号是否接收完毕，如果接收完毕，处理码值
		if(i==32){
			//提取数据码
			command = 0x00;
			for(i=16;i<24;i++){
				//大于某值为1，和晶振有绝对关系，这里使用16M计算，此值可以有一定误差
				if(irdata[i]>9){
					command|=0x80;
				}
				command=i<23?command>>1:command;
			}
			isIrOk=1;//红外码值处理完成标志
		}
	}

	irTime=0;//计时归零

}

/*------------------------------------------------
                定时器0初始化
------------------------------------------------*/
void T0_init(void)//定时器0初始化
{
  TMOD=0x02;//定时器0工作方式2，8位，256usTH0是重装值，TL0是初值
  TH0=0x00; //重载值
  TL0=0x00; //初始化值
  ET0=1;    //开中断
  TR0=1;    
}
/*------------------------------------------------
                  外部中断0初始化
------------------------------------------------*/
void EX0_init(void)
{
 IT0 = 1;   //指定外部中断0下降沿触发，INT0 (P3.2)
 EX0 = 1;   //使能外部中断
 EA = 1;    //开总中断
}
/*------------------------------------------------
                  IR初始化
------------------------------------------------*/
void IR_init(){
	EX0_init();
	T0_init();
}

/*------------------------------------------------
                    键值扫描(只取数据码)
------------------------------------------------*/
unsigned char scanIr(){
	if(isIrOk){
		isIrOk = 0;//清除红外键值码处理完成标志
		return(command);
	}
	return(0);
}
  